3B/CS486/06-Inference-and-Planning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-18 Fri 17:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inference And Planning</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Inference And Planning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd49af7e">1. Problem Solving</a>
<ul>
<li><a href="#orge4000c0">1.1. Logical Consequence</a></li>
</ul>
</li>
<li><a href="#org72bc0db">2. Proofs</a>
<ul>
<li><a href="#org9a30a0a">2.1. Bottom-Up Proof</a></li>
<li><a href="#org3d59095">2.2. Top-Down Proof</a></li>
</ul>
</li>
<li><a href="#org84eb8a7">3. Planning and Actions</a>
<ul>
<li><a href="#org4189a88">3.1. Forward Planning</a></li>
<li><a href="#orgff305cb">3.2. Regression Planning</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd49af7e" class="outline-2">
<h2 id="orgd49af7e"><span class="section-number-2">1.</span> Problem Solving</h2>
<div class="outline-text-2" id="text-1">
<p>
Two methods for solving problems:
</p>
<ul class="org-ul">
<li><b>procedural</b>
<ul class="org-ul">
<li>devise an algorithm</li>
<li>program an algorithm</li>
<li>execute the program</li>
</ul></li>
<li><b>declarative</b>
<ul class="org-ul">
<li>identify knowledge needed</li>
<li>encode the knowledge in a representation (knowledge base - KB)</li>
<li>use logical consequences of KB to solve the problem</li>
</ul></li>
</ul>

<p>
A logic consists of <b>syntax</b>, <b>semantics</b>, and <b>proof procedure</b>.
</p>

<p>
<b>Proof</b>: a sequence of sentences derivable using an inference rule
</p>
</div>
<div id="outline-container-orge4000c0" class="outline-3">
<h3 id="orge4000c0"><span class="section-number-3">1.1.</span> Logical Consequence</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For a set of <b>statements</b> \(\{X\}\):
</p>
<ul class="org-ul">
<li>a set of truth assignments is an <b>interpretation</b></li>
<li>an interpretation that makes it true is a <b>model</b></li>
<li>if it has no model, it is <b>inconsistent</b></li>
</ul>

<p>
A statement is a <b>logical consequence</b> of a set of statements if the statement is true in every
model of the set.
</p>

<p>
An argument is <b>valid</b> if:
</p>
<ul class="org-ul">
<li>conclusions are logical consequences of the premise</li>
<li>conclusions are true in every model of the premises</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org72bc0db" class="outline-2">
<h2 id="org72bc0db"><span class="section-number-2">2.</span> Proofs</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Knowledge Base</b>: set of axioms
</p>

<p>
KB \(\vdash g\) means \(g\) can be derived from KB using the proof procedure.
If it is true, then \(g\) is a theorem.
</p>

<p>
<b>Soundness</b>: if KB \(\vdash g\), then KB \(\models g\).
</p>

<p>
<b>Completeness</b>: if KB \(\models g\), then KB \(\vdash g\).
</p>

<p>
Assume a <b>closed world</b>:
</p>
<ul class="org-ul">
<li>agent knows everything</li>
<li>if it cannot prove something, it must be false</li>
<li>negation is failure</li>
</ul>
</div>
<div id="outline-container-org9a30a0a" class="outline-3">
<h3 id="org9a30a0a"><span class="section-number-3">2.1.</span> Bottom-Up Proof</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Forward chaining</b>: start from facts and use rules to generate all possible atoms
</p>

<p>
Forward chaining is sound and complete.
</p>
</div>
</div>
<div id="outline-container-org3d59095" class="outline-3">
<h3 id="org3d59095"><span class="section-number-3">2.2.</span> Top-Down Proof</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Start with query and work backwards, trying to see if it is proved from the premises.
</p>
<p>
In the <span class="underline">select</span> step, some selections will lead to solutions more quickly, though any should lead
to a solution in the end.
In the <span class="underline">choose</span> step, if one choice doesn&rsquo;t give a solution, others may, so all must be tried.
</p>

<p>
KB can contain <b>relations</b> (predicates) or <b>quantification</b>.
</p>
</div>
</div>
</div>
<div id="outline-container-org84eb8a7" class="outline-2">
<h2 id="org84eb8a7"><span class="section-number-2">3.</span> Planning and Actions</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Planning</b>: decide what to do based on the agent&rsquo;s ability, goals, and state of the world; basically find
a sequence of actions to the goal
</p>

<p>
Assume:
</p>
<ul class="org-ul">
<li>a single agent</li>
<li>deterministic world</li>
<li>no events outside the agent&rsquo;s control that change the state of the world</li>
<li>agent knows what state the world is in (full observability)</li>
<li>time progresses discreetly</li>
<li>goals are predicates of states that must be achieved/maintained</li>
</ul>

<p>
<b>Action</b>: partial function (some actions only possible from some states) from states to states
</p>

<p>
<b>Preconditions</b> of an action specify if it can occur. <b>Effect</b> of an action specifies resulting state.
</p>

<p>
<b>Causal rules</b> specify when a feature gets a new value. <b>Frame rules</b> specify when the feature keeps
its values.
</p>

<p>
In planning, the givens are:
</p>
<ul class="org-ul">
<li>description of effects and preconditions of actions</li>
<li>description of initial state</li>
<li>goal to achieve</li>
</ul>

<p>
Achieved by finding a sequence of possible actions that will result is state that satisfies the goal.
</p>
</div>
<div id="outline-container-org4189a88" class="outline-3">
<h3 id="org4189a88"><span class="section-number-3">3.1.</span> Forward Planning</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Search in the state-space graph:
</p>
<ul class="org-ul">
<li>nodes represent states</li>
<li>arcs correspond to actions legal from that state</li>
<li>plan is a path from the initial state to a goal state</li>
<li>heuristics can be important</li>
</ul>
</div>
</div>
<div id="outline-container-orgff305cb" class="outline-3">
<h3 id="orgff305cb"><span class="section-number-3">3.2.</span> Regression Planning</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Search backwards from the goal description with nodes corresponding to subgoals and arcs to actions:
</p>
<ul class="org-ul">
<li>nodes are propositions (assignments of values to features)</li>
<li>arcs correspond to actions that can achieve goals</li>
<li>neighbours of a node specify what must be true immediately before the arc so that the node is true
immediately after</li>
<li>start node is the goal to be achieved</li>
<li>\(\text{goal}(N)\) is true if \(N\) is a proposition true of the initial state</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-18 Fri 17:39</p>
</div>
</body>
</html>
